Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Constructor (IEnumerable<Int16>)
 Initializes a new instance of the NumericConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumericConstantFilterExpression(
	IEnumerable<short> Values
)
Public Sub New (
	Values As IEnumerable(Of Short)
)
Parameters
Values
Type: System.Collections.Generic.IEnumerable<Int16>
The values to represent.
See Also
Reference
NumericConstantFilterExpression Class
NumericConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace